konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/HardwareProfile_STM32.h
// *************************************************************************************************
//									H a r d w a r e P r o f i l e . h
// *************************************************************************************************
//
//		Project:	SmartTrak Solar Panel Controller
//
//		Contains:	PIC32MX360F512L MCU Definitions and I/O Port Assignments
//
// *************************************************************************************************

// this file originated as Microchip supplied HardwareProfile_PIC32_STK.h, but little of the original file remains.

#ifndef __HARDWARE_PROFILE_H
    #define __HARDWARE_PROFILE_H

//#ifndef __PIC32MX__
//    #error  "Firmware source code supports PIC32 ONLY"
//#endif

// ******************************************************************************
//							MCU CLocks
// ******************************************************************************

/**********************************************************
* GetSystemClock() returns system clock frequency.
*
* GetPeripheralClock() returns peripheral clock frequency.
*
* GetInstructionClock() returns instruction clock frequency.
*
**********************************************************/

/*********************************************************
* Macro: #define	GetSystemClock() 
*
* Overview: This macro returns the system clock frequency in Hertz.
*			* value is 8 MHz x 4 PLL for PIC24
*			* value is 8 MHz/2 x 18 PLL for PIC32
*
*********************************************************/

// System Clock: 80 MHz ((8MHz Crystal/ FPLLIDIV) * FPLLMUL) / FPLLODIV)
// see MCUConfigurationBits.h

#define GetSystemClock()    (80000000ul)
#define SYS_FREQ 			(80000000)

/*********************************************************************
* Macro: #define	GetPeripheralClock() 
*
* Overview: This macro returns the peripheral clock frequency 
*			used in Hertz.
*			* value for PIC24 is <PRE>(GetSystemClock()/2) </PRE> 
*			* value for PIC32 is <PRE>(GetSystemClock()/(1<<OSCCONbits.PBDIV)) </PRE>
*
********************************************************************/
#define GetPeripheralClock()    (GetSystemClock() / (1 << OSCCONbits.PBDIV))

/*********************************************************************
* Macro: #define	GetInstructionClock() 
*
* Overview: This macro returns instruction clock frequency 
*			used in Hertz.
*			* value for PIC24 is <PRE>(GetSystemClock()/2) </PRE> 
*			* value for PIC32 is <PRE>(GetSystemClock()) </PRE> 
*
********************************************************************/
#define GetInstructionClock()   (GetSystemClock())


/* ################################################################## */

//	SmartTrak PLATFORM_SMARTTRAK_V1 Hardware MCU Connections
//	Designator Type Usage Package
//	U1		MC33926		Azimuth H-Bridge				RB2 (/SF), OC2 (IN2), OC1(IN1), RE1 (/D2), RE0(D1), RF0 (EN), RG3 (SLEW), RG2 (INV), RB4 (FB)
//	U2		MC33926		Elevation H-Bridge				RB3 (/SF), OC4 (IN2), OC3(IN1), RE3 (/D2), RE2 (D1), RF1 (EN), RE5 (SLEW), RE6 (INV), RB5 (FB)
//	U3		MAX5035		DC-DC 24V to 5V Step Down		RB9
//	U4		LT3009		DC-DC 5V to 3.3V LDO			RG6 (/SHDN)
//	U5		MAX3221		RS-232 Level Shift				RF2 (Rx Out), RF3 (Tx In)
//	U6		MAX3535		RS-485 Interface/Level Shift	RF4, RF5, RA9, RA15
//	U7		RS-485		Isolation Transformer
//	U8		UCA9554		I/O Expander for Switches(I2C)	RA2 (SCL), RA3 (SDA), RE8 (INT)
//	U9		UCA9554		I/O Expander for LEDs (12C)		RA2 (SCL), RA3 (SDA)
//	U10		DS3232		RTCC (I2C)						RA2 (SCL), RA3 (SDA), RC2 (Reset)
//	U11		SST25VF016B Flash Memory (SPI)				RA14 (/CE), RF6 (SCK), RF7(SO), RF8 (SI), RG0 (/HOLD)

//	Other Connections to MCU
//	AZ0		Azimuth Hall Effect A						RD10
//	AZ1		Azimuth Hall Effect B						RD11
//	EL0		Elevation Hall Effect A						RD8
//	EL0		Elevation Hall Effect A						RD9
//	J9		Screw Terminals	(extra connections)			RB10, RB11, RB12, RB13, RB14, RB15

/*********************************************************************
* IOS FOR THE FLASH/EEPROM SPI (MCU SPI1)
*********************************************************************/
//// see SST25VF016.h for standard SPI bus definitions
//#define USE_SST25_SPI1

//#if defined (USE_SST25_SPI1)  && defined (DISPLAY_XC32_MESSAGES)
//	#warning SPI Flash on SPI
//#endif

////	U11		SST25VF016B Flash Memory (SPI)				RA14 (/CE), RF6 (SCK), RF7(SO), RF8 (SI), RG0 (/HOLD)

//#if defined (PLATFORM_PIC32_SK)
//	// definitions here are ONLY for pins that are NOT part of the standard SPI bus
//	#define SST25_CS_TRIS   TRISFbits.TRISF2                // for PICTail Demo board
//	#define SST25_CS_LAT    LATFbits.LATF2

//	#define SST25_HOLD_TRIS TRISFbits.TRISF1                // for PICTail Demo board
//	#define SST25_HOLD_LAT  LATFbits.LATF1

//#elif defined (PLATFORM_SMARTTRAK_V1)
//	#define SST25_CS_TRIS   TRISAbits.TRISA14				// for SmartTrak Hardware
//	#define SST25_CS_LAT    LATAbits.LATA14

//	#define SST25_HOLD_TRIS TRISGbits.TRISG0				// for SmartTrak Hardware
//	#define SST25_HOLD_LAT  LATGbits.LATG0
//#else
//	#error Platform must be defined
//#endif		// PLATFORM_SMARTTRAK_V1

///*********************************************************************
//*	IOS FOR THE I2C BUS (MCU I2C2)
//*********************************************************************/

//#define	DS3232_I2C_BUS					I2C2
//#define	LED_IO_EXPANDER_I2C_BUS			I2C2
//#define	SWITCH_IO_EXPANDER_I2C_BUS		I2C2
//#define MMA8452Q_I2C_BUS				I2C2

//// PCA9554 I/O Expander Addressing
//// NOTE: addresses here are UNSHIFTED 7 bit addresses
//// device address as set by A2 A1 A0 pins will be added to this
//#if defined (USE_PCA9554_ADDR)						// devices labeled P54
//	#define	PCA_9554_IC_ADDR			0x20		// 7 bit address is 0100 A2 A1 A0
//#elif defined (USE_PCA9554A_ADDR)					// devices labeled 54A
//	#define	PCA_9554_IC_ADDR			0x38		// 7 bit address is 0111 A2 A1 A0
//#else
//	#error PCA9554 I/O Expander Addressing must be defined
//#endif

//// device addresses, as set by logic levels at pins A2, A1, A0
//#if defined (PLATFORM_PIC32_SK)
//	#define	LED_IO_EXPANDER_PCB_ADDR		0x07		// set by PCB traces
//	#define	SWITCH_IO_EXPANDER_PCB_ADDR		0x07		// set by PCB traces, single device shared on PIC32_SK
//#elif defined (PLATFORM_SMARTTRAK_V1)
//	#define	LED_IO_EXPANDER_PCB_ADDR		0x07		// set by PCB traces
//	#define	SWITCH_IO_EXPANDER_PCB_ADDR		0x06		// set by PCB traces
//#else
//	#error Platform must be defined
//#endif		// PLATFORM_SMARTTRAK_V1

