konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/HardwareProfile_STM32.h
//// To create the address written the device, these bits are shifted one position LEFT, and the LSB is the R/NOT_W bit
//#define	LED_IO_EXPANDER_I2C_ADDR		(PCA_9554_IC_ADDR + LED_IO_EXPANDER_PCB_ADDR)
//#define	SWITCH_IO_EXPANDER_I2C_ADDR		(PCA_9554_IC_ADDR + SWITCH_IO_EXPANDER_PCB_ADDR)

//#if defined(USE_I2C_NORMAL_CLOCK)
//	#define	I2C_CLOCK_FREQ					100000		// nomimal 12C clock frequency
//#elif defined (USE_I2C_FAST_CLOCK)
//	#define	I2C_CLOCK_FREQ					400000		// fast 12C clock frequency
//#else
//	#error I2C CLock must be defined
//#endif

//// See DS3232.h for DS3232 address
//// See MMA845x.h for MMA8452Q address

//// individual pins, used for I2CReset() sequence
//// SCL2/RA2	pin 58	TP34, next to pushbuttons
//// SDA2/RA3 pin 59	TP36, next to batter

//// TRISx (data direction) 1 = input (default), 0 = output
//// ODCx  (open drain control)  1 = open drain, 0 = digital (default)  NOTE: affects ALL modes, including PERIPHERAL control!

//#define I2C2_SCL_TRIS		TRISAbits.TRISA2				// for SmartTrak Hardware
//#define I2C2_SCL_LAT		LATAbits.LATA2

//#define I2C2_SDA_TRIS		TRISAbits.TRISA3				// for SmartTrak Hardware
//#define I2C2_SDA_LAT		LATAbits.LATA3

//#define I2C2_PORT			IOPORT_A
//#define	PIN_I2C2_SCL		BIT_2
//#define	PIN_I2C2_SDA		BIT_3

//#define	I2C_GPIO_SCL_MASK	PIN_I2C2_SCL
//#define	I2C_GPIO_SDA_MASK	PIN_I2C2_SDA
//#define	I2C_GPIO_MASK		(PIN_I2C2_SCL | PIN_I2C2_SDA)


/*
extern inline void __attribute__((always_inline)) InitDiscreteI2C2(void)
{
	// Clock (SCL) and Data (SDA) pins
	PORTClearBits(I2C2_PORT, PIN_I2C2_SCL | PIN_I2C2_SDA);
	PORTSetPinsDigitalIn(I2C2_PORT, PIN_I2C2_SCL | PIN_I2C2_SDA);

}
*/

/*********************************************************************
* IOS FOR ADC Inputs
*********************************************************************/

//#define ADC_TEMP    ADC_CH0_POS_SAMPLEA_AN4
//#define ADC_POT     ADC_CH0_POS_SAMPLEA_AN5


/*********************************************************************
* IOS FOR THE UART
*********************************************************************/

// See SmartTrak.h for UART1, UART2 assignments and baud rates

/*********************************************************************
* RTCC DEFAULT INITIALIZATION (these are values to initialize the RTCC
*********************************************************************/
// these definitions are for the internal RTCC, not currently in use

#define RTCC_DEFAULT_DAY        29      // 29
#define RTCC_DEFAULT_MONTH      4       // April
#define RTCC_DEFAULT_YEAR       13      // 2013
#define RTCC_DEFAULT_WEEKDAY    04      // Thursday
#define RTCC_DEFAULT_HOUR       10      // 10:10:01
#define RTCC_DEFAULT_MINUTE     10
#define RTCC_DEFAULT_SECOND     01

#include <stm32f4xx.h>
/*********************************************************************
* Build & Compile date and time
*********************************************************************/

// Example of __DATE__ string: "Jul 27 2012"
// Example of __TIME__ string: "21:06:19"

#define COMPUTE_BUILD_YEAR \
    ( \
        (__DATE__[ 7] - '0') * 1000 + \
        (__DATE__[ 8] - '0') *  100 + \
        (__DATE__[ 9] - '0') *   10 + \
        (__DATE__[10] - '0') \
    )


#define COMPUTE_BUILD_DAY \
    ( \
        ((__DATE__[4] >= '0') ? (__DATE__[4] - '0') * 10 : 0) + \
        (__DATE__[5] - '0') \
    )


#define BUILD_MONTH_IS_JAN (__DATE__[0] == 'J' && __DATE__[1] == 'a' && __DATE__[2] == 'n')
#define BUILD_MONTH_IS_FEB (__DATE__[0] == 'F')
#define BUILD_MONTH_IS_MAR (__DATE__[0] == 'M' && __DATE__[1] == 'a' && __DATE__[2] == 'r')
#define BUILD_MONTH_IS_APR (__DATE__[0] == 'A' && __DATE__[1] == 'p')
#define BUILD_MONTH_IS_MAY (__DATE__[0] == 'M' && __DATE__[1] == 'a' && __DATE__[2] == 'y')
#define BUILD_MONTH_IS_JUN (__DATE__[0] == 'J' && __DATE__[1] == 'u' && __DATE__[2] == 'n')
#define BUILD_MONTH_IS_JUL (__DATE__[0] == 'J' && __DATE__[1] == 'u' && __DATE__[2] == 'l')
#define BUILD_MONTH_IS_AUG (__DATE__[0] == 'A' && __DATE__[1] == 'u')
#define BUILD_MONTH_IS_SEP (__DATE__[0] == 'S')
#define BUILD_MONTH_IS_OCT (__DATE__[0] == 'O')
#define BUILD_MONTH_IS_NOV (__DATE__[0] == 'N')
#define BUILD_MONTH_IS_DEC (__DATE__[0] == 'D')


#define COMPUTE_BUILD_MONTH \
    ( \
        (BUILD_MONTH_IS_JAN) ?  1 : \
        (BUILD_MONTH_IS_FEB) ?  2 : \
        (BUILD_MONTH_IS_MAR) ?  3 : \
        (BUILD_MONTH_IS_APR) ?  4 : \
        (BUILD_MONTH_IS_MAY) ?  5 : \
        (BUILD_MONTH_IS_JUN) ?  6 : \
        (BUILD_MONTH_IS_JUL) ?  7 : \
        (BUILD_MONTH_IS_AUG) ?  8 : \
        (BUILD_MONTH_IS_SEP) ?  9 : \
        (BUILD_MONTH_IS_OCT) ? 10 : \
        (BUILD_MONTH_IS_NOV) ? 11 : \
        (BUILD_MONTH_IS_DEC) ? 12 : \
        /* error default */  99 \
    )

#define COMPUTE_BUILD_HOUR ((__TIME__[0] - '0') * 10 + __TIME__[1] - '0')
#define COMPUTE_BUILD_MIN  ((__TIME__[3] - '0') * 10 + __TIME__[4] - '0')
#define COMPUTE_BUILD_SEC  ((__TIME__[6] - '0') * 10 + __TIME__[7] - '0')


#define BUILD_DATE_IS_BAD (__DATE__[0] == '?')

#define BUILD_YEAR  ((BUILD_DATE_IS_BAD) ? 99 : COMPUTE_BUILD_YEAR)
#define BUILD_MONTH ((BUILD_DATE_IS_BAD) ? 99 : COMPUTE_BUILD_MONTH)
#define BUILD_DAY   ((BUILD_DATE_IS_BAD) ? 99 : COMPUTE_BUILD_DAY)

#define BUILD_TIME_IS_BAD (__TIME__[0] == '?')

#define BUILD_HOUR  ((BUILD_TIME_IS_BAD) ? 99 :  COMPUTE_BUILD_HOUR)
#define BUILD_MIN   ((BUILD_TIME_IS_BAD) ? 99 :  COMPUTE_BUILD_MIN)
#define BUILD_SEC   ((BUILD_TIME_IS_BAD) ? 99 :  COMPUTE_BUILD_SEC)


/*********************************************************************
* PIC32 SK LEDs
*********************************************************************/

// these functions are for the LEDs on the PIC32 Starter kit board, NOT the PCA9554
#if defined (PLATFORM_PIC32_SK)
	typedef enum
	{
		LED_1,
		LED_2,
		LED_3,
	} PIC32_SK_LED;

	#define PORT_LEDS   IOPORT_D
	#define PIN_LED1    BIT_0
	#define PIN_LED2    BIT_1
	#define PIN_LED3    BIT_2

	extern inline void __attribute__((always_inline)) SetLEDDirection(void)
	{
	   PORTSetPinsDigitalOut(PORT_LEDS, (PIN_LED1 | PIN_LED2 | PIN_LED3));
	}

	extern inline void __attribute__((always_inline)) TurnLEDOn(PIC32_SK_LED led)
	{
		// starter kit LEDs are active HIGH
		if(led == LED_1)
		  PORTSetBits(PORT_LEDS, PIN_LED1);

		if(led == LED_2)
		  PORTSetBits(PORT_LEDS, PIN_LED2);

