konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/HardwareProfile_STM32.h
		if(led == LED_3)
		  PORTSetBits(PORT_LEDS, PIN_LED3);

	}

	extern inline void __attribute__((always_inline)) TurnLEDOff(PIC32_SK_LED led)
	{
		if(led == LED_1)
		  PORTClearBits(PORT_LEDS, PIN_LED1);

		if(led == LED_2)
		  PORTClearBits(PORT_LEDS, PIN_LED2);

		if(led == LED_3)
		  PORTClearBits(PORT_LEDS, PIN_LED3);

	}

	extern inline void __attribute__((always_inline)) ToggleLED(PIC32_SK_LED led)
	{
		if(led == LED_1)
		  PORTToggleBits(PORT_LEDS, PIN_LED1);

		if(led == LED_2)
		  PORTToggleBits(PORT_LEDS, PIN_LED2);

		if(led == LED_3)
		  PORTToggleBits(PORT_LEDS, PIN_LED3);

	}

	extern inline void __attribute__((always_inline)) TurnLEDAllOn(void)
	{
		  PORTSetBits(PORT_LEDS, PIN_LED1);
		  PORTSetBits(PORT_LEDS, PIN_LED2);
		  PORTSetBits(PORT_LEDS, PIN_LED3);

	}

	extern inline void __attribute__((always_inline)) TurnLEDAllOff(void)
	{
		  PORTClearBits(PORT_LEDS, PIN_LED1);
		  PORTClearBits(PORT_LEDS, PIN_LED2);
		  PORTClearBits(PORT_LEDS, PIN_LED3);
	}

#elif defined (PLATFORM_SMARTTRAK_V1)
	// SmartTrak hardware places all controllable LEDs on I/O Expander U9
	//	U9		UCA9554		I/O Expander for LEDs (12C)		RA2 (SCL), RA3 (SDA)

	typedef enum
	{
		LED_1,
		LED_2,
		LED_3,
		LED_4,
		LED_5,
		LED_6,
		LED_7,
		LED_8,

	} SMARTTRAK_LED;

	extern inline void __attribute__((always_inline)) SetLEDDirection(void)
	{

	}

	extern inline void __attribute__((always_inline)) TurnLEDOn(SMARTTRAK_LED led)
	{

	}

	extern inline void __attribute__((always_inline)) TurnLEDOff(SMARTTRAK_LED led)
	{

	}

	extern inline void __attribute__((always_inline)) ToggleLED(SMARTTRAK_LED led)
	{

	}

	extern inline void __attribute__((always_inline)) TurnLEDAllOn(void)
	{

	}

	extern inline void __attribute__((always_inline)) TurnLEDAllOff(void)
	{

	}

	//	U9		UCA9554		I/O Expander for LEDs (12C)		RA2 (SCL), RA3 (SDA)
#endif		// NOT PLATFORM_PIC32_SK

#if defined (PLATFORM_SMARTTRAK_V1) && defined (DISPLAY_XC32_MESSAGES)
    #warning  "SmartTrak hardware LEDs not yet implemented"
#endif


/*********************************************************************
* PIC32 SK Switches
*********************************************************************/

#if defined (PLATFORM_PIC32_SK)
	typedef enum
	{
		SWITCH_1,
		SWITCH_2,
		SWITCH_3,
	} PIC32_SK_SWITCHES;

	#define PORT_SWITCHES   IOPORT_D
	#define PIN_SW1    BIT_6
	#define PIN_SW2    BIT_7
	#define PIN_SW3    BIT_13

	#define BIT_SW1    RD6
	#define BIT_SW2    RD7
	#define BIT_SW3    RD13

#elif defined (PLATFORM_SMARTTRAK_V1)
	//	U8		UCA9554		I/O Expander for Switches(I2C)	RA2 (SCL), RA3 (SDA), RE8 (INT)
#endif		// NOT PLATFORM_PIC32_SK

#if defined (PLATFORM_SMARTTRAK_V1) && defined (DISPLAY_XC32_MESSAGES)
    #warning  "SmartTrak hardware Switches not yet implemented"
#endif


/*********************************************************************
* PIC32 Motor Drive Definitions
*********************************************************************/

#if defined (PLATFORM_PIC32_SK)

	// NOTE: PIC32 Starter Kit wiring is VERY different from the SmartTrak wiring,
	//		and several pins are simply jumpered rather than controlled by the MCU

	//	SLEW	default (open) low = SLOW
	//	INV		default (open) low = NON INVERTED
	//	EN		default (open) low = SLEEP, must be driven HIGH by MCU
	//	D1		default (open) high = DISABLED, must be driven LOW by jumper
	// /D2		default (open) low = DISABLED, must be driven HIGH by jumper

	// Connections to MC33926 H-Bridge ICs
	//	Motor Enable EN			RE4			Digital Out

	//	Bridge1 Feedback FB		RB4/AN4		Analog In
	//	Bridge1 Status Flag /SF	RB2			Digital In
	// 	Bridge1 PWM_1			OC1/RD0		Peripheral Out
	// 	Bridge1 PWM_2			OC2/RD1		Peripheral Out
	//	Bridge1 SLEW			open, LOW
	//	Bridge1 INV				open, LOW
	//	Bridge1 D1				jumper LOW
	//	Bridge1 /D2				jumper HIGH

	//	Bridge2 Feedback FB		RB5/AN5		Analog In
	//	Bridge2 Status Flag /SF	RB3			Digital In
	// 	Bridge2 PWM_1			OC3/RD2		Peripheral Out
	// 	Bridge2 PWM_2			OC4/RD3		Peripheral Out
	//	Bridge2 SLEW			open, LOW
	//	Bridge2 INV				open, LOW
	//	Bridge2 D1				jumper LOW
	//	Bridge2 /D2				jumper HIGH

	#define PORT_BRIDGE_ENABLE	IOPORT_E
	#define	PIN_BRIDGE_ENABLE	BIT_4

	#define PORT_BRIDGE_CTRL	IOPORT_B
	#define PIN_BRIDGE1_FB		BIT_4
	#define PIN_BRIDGE1_SF		BIT_2

	#define PIN_BRIDGE2_FB		BIT_5
	#define PIN_BRIDGE2_SF		BIT_3

	extern inline void __attribute__((always_inline)) InitMotorDrive(void)
	{
		// Feedback (FB) and Status Flag (SF) pins
		PORTClearBits(PORT_BRIDGE_CTRL, PIN_BRIDGE1_FB | PIN_BRIDGE1_SF | PIN_BRIDGE2_FB | PIN_BRIDGE2_SF);
		PORTSetPinsDigitalIn(PORT_BRIDGE_CTRL, PIN_BRIDGE1_SF | PIN_BRIDGE2_SF);

		// set Feedback pins to Analog IN

		// Enable Pins, initially LOW
		PORTClearBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE_ENABLE);
		PORTSetPinsDigitalOut(PORT_BRIDGE_ENABLE, PIN_BRIDGE_ENABLE);
	}

	extern inline void __attribute__((always_inline)) EnableMotorDrive(void)
	{
		  PORTSetBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE_ENABLE);
	}

	extern inline void __attribute__((always_inline)) DisableMotorDrive(void)
	{
		  PORTClearBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE_ENABLE);
	}

	extern inline UINT16 __attribute__((always_inline)) ReadBridgeSFPins(void)
	{
		return (PORTReadBits(PORT_BRIDGE_CTRL, PIN_BRIDGE1_SF | PIN_BRIDGE2_SF));
	}

#elif defined (PLATFORM_SMARTTRAK_V1) && defined (DRIV_MC33926)
	//	SmartTrak Hardware MCU Connections
	//	U1		MC33926		Azimuth H-Bridge				RB2 (/SF), OC2 (IN2), OC1(IN1), RE1 (/D2), RE0(D1), RF0 (EN), RG3 (SLEW), RG?? (INV), RB4 (FB)
	//	U2		MC33926		Elevation H-Bridge				RB3 (/SF), OC4 (IN2), OC3(IN1), RE3 (/D2), RE2(D1), RF1 (EN), RE5 (SLEW), RE6 (INV), RB5 (FB)

	// Connections to MC33926 H-Bridge ICs

	//	Bridge1 Enable EN		RF0			Digital Out		split, different port
	//	Bridge1 Feedback FB		RB4/AN4		Analog In		same
	//	Bridge1 Status Flag /SF	RB2			Digital In		same
	// 	Bridge1 PWM_1			OC1/RD0		Peripheral Out	same
	// 	Bridge1 PWM_2			OC2/RD1		Peripheral Out	same
	//	Bridge1 SLEW			RG3			Digital Out, LOW
	//	Bridge1 INV				RG2			Digital Out, LOW
	//	Bridge1 D1				RE0			Digital Out, LOW
	//	Bridge1 /D2				RE1			Digital Out, HIGH

	//	Bridge2 Enable EN		RF1			Digital Out
	//	Bridge2 Feedback FB		RB5/AN5		Analog In
	//	Bridge2 Status Flag /SF	RB3			Digital In
	// 	Bridge2 PWM_1			OC3/RD2		Peripheral Out
	// 	Bridge2 PWM_2			OC4/RD3		Peripheral Out
	//	Bridge2 SLEW			RE5			Digital Out, LOW
	//	Bridge2 INV				RE6			Digital Out, LOW
	//	Bridge2 D1				RE2			Digital Out, LOW
	//	Bridge2 /D2				RE3			Digital Out, HIGH

	#define PORT_BRIDGE_ENABLE	IOPORT_F
	#define	PIN_BRIDGE1_ENABLE	BIT_0
	#define	PIN_BRIDGE2_ENABLE	BIT_1


	#define PORT_BRIDGE_CTRL	IOPORT_B
	#define PIN_BRIDGE1_FB		BIT_4
	#define PIN_BRIDGE1_SF		BIT_2

	#define PIN_BRIDGE2_FB		BIT_5
	#define PIN_BRIDGE2_SF		BIT_3

	#define PORT_BRIDGE1_CONFIG	IOPORT_G
	#define PIN_BRIDGE1_SLEW	BIT_3
	#define PIN_BRIDGE1_INV		BIT_2

	#define PORT_BRIDGE2_CONFIG	IOPORT_E
	#define PIN_BRIDGE2_SLEW	BIT_5
	#define PIN_BRIDGE2_INV		BIT_6


	#define PORT_BRIDGE_DISABLE	IOPORT_E
	#define	PIN_BRIDGE1_D1		BIT_0
	#define	PIN_BRIDGE1_NOT_D2	BIT_1

	#define	PIN_BRIDGE2_D1		BIT_2
	#define	PIN_BRIDGE2_NOT_D2	BIT_3

	extern inline void __attribute__((always_inline)) InitMotorDrive(void)
	{
		// Feedback (FB) and Status Flag (SF) pins
		PORTClearBits(PORT_BRIDGE_CTRL, PIN_BRIDGE1_FB | PIN_BRIDGE1_SF | PIN_BRIDGE2_FB | PIN_BRIDGE2_SF);
		PORTSetPinsDigitalIn(PORT_BRIDGE_CTRL, PIN_BRIDGE1_SF | PIN_BRIDGE2_SF);

		// set Feedback pins to Analog IN


		// Configuration Bits SLEW and INV, both LOW
		PORTClearBits(PORT_BRIDGE1_CONFIG, PIN_BRIDGE1_SLEW | PIN_BRIDGE1_INV);
		PORTSetPinsDigitalOut(PORT_BRIDGE1_CONFIG, PIN_BRIDGE1_SLEW | PIN_BRIDGE1_INV);
		PORTClearBits(PORT_BRIDGE2_CONFIG, PIN_BRIDGE2_SLEW | PIN_BRIDGE2_INV);
		PORTSetPinsDigitalOut(PORT_BRIDGE2_CONFIG, PIN_BRIDGE2_SLEW | PIN_BRIDGE2_INV);

