konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/HardwareProfile_STM32.h
		// Disable bits, initialze to DISABLED, D1 HIGH, /D2 LOW
		PORTSetBits(PORT_BRIDGE_DISABLE, PIN_BRIDGE1_D1 | PIN_BRIDGE2_D1);
		PORTClearBits(PORT_BRIDGE_DISABLE, PIN_BRIDGE1_NOT_D2 | PIN_BRIDGE2_NOT_D2);
		PORTSetPinsDigitalOut(PORT_BRIDGE_DISABLE, PIN_BRIDGE1_D1 | PIN_BRIDGE1_NOT_D2 | PIN_BRIDGE2_D1 | PIN_BRIDGE2_NOT_D2);

		// Enable Pins, initially LOW
		PORTClearBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE1_ENABLE | PIN_BRIDGE2_ENABLE);
		PORTSetPinsDigitalOut(PORT_BRIDGE_ENABLE, PIN_BRIDGE1_ENABLE | PIN_BRIDGE2_ENABLE);
	}

	extern inline void __attribute__((always_inline)) EnableMotorDrive(void)
	{
		// Disable bits, to ENABLED, D1 LOW, /D2 HIGH
		PORTClearBits(PORT_BRIDGE_DISABLE, PIN_BRIDGE1_D1 | PIN_BRIDGE2_D1);
		PORTSetBits(PORT_BRIDGE_DISABLE, PIN_BRIDGE1_NOT_D2 | PIN_BRIDGE2_NOT_D2);

		PORTSetBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE1_ENABLE | PIN_BRIDGE2_ENABLE);
	}

	extern inline void __attribute__((always_inline)) DisableMotorDrive(void)
	{
		PORTClearBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE1_ENABLE | PIN_BRIDGE2_ENABLE);

		// Disable bits, to DISABLED, D1 HIGH, /D2 LOW
		PORTSetBits(PORT_BRIDGE_DISABLE, PIN_BRIDGE1_D1 | PIN_BRIDGE2_D1);
		PORTClearBits(PORT_BRIDGE_DISABLE, PIN_BRIDGE1_NOT_D2 | PIN_BRIDGE2_NOT_D2);
	}

	extern inline UINT16 __attribute__((always_inline)) ReadBridgeSFPins(void)
	{
		return (PORTReadBits(PORT_BRIDGE_CTRL, PIN_BRIDGE1_SF | PIN_BRIDGE2_SF));
	}

#elif defined (PLATFORM_SMARTTRAK_V1) && defined (DRIV_VNH5050A)
        //	SmartTrak Hardware MCU Connections
	//	U1		VNH5050A-E		Azimuth H-Bridge	AN1 (CS), OC2 (INB), OC1(INA), RF0 (EN), OC5(IN_PWM)
	//	U2		VNH5050A-E		Elevation H-Bridge	AN2 (CS), OC4 (INB), OC3(INA), RF1 (EN), OC5(IN_PWM)

	// Connections to VNH5050A-E H-Bridge ICs

	//	Bridge1 Enable EN		RF0			Digital Out		split, different port
	// 	Bridge1 PWM_1			OC1/RD0		Peripheral Out	same
	// 	Bridge1 PWM_2			OC2/RD1		Peripheral Out	same
        // 	Bridge1 IN_PWM			OC5		Peripheral Out	same

	//	Bridge2 Enable EN		RF1			Digital Out
	// 	Bridge2 PWM_1			OC3/RD2		Peripheral Out
	// 	Bridge2 PWM_2			OC4/RD3		Peripheral Out
          // 	Bridge1 IN_PWM			OC5		Peripheral Out	same

	#define PORT_BRIDGE_ENABLE	IOPORT_F
	#define	PIN_BRIDGE1_ENABLE	BIT_0
	#define	PIN_BRIDGE2_ENABLE	BIT_1
 
	extern inline void __attribute__((always_inline)) InitMotorDrive(void)
	{
		PORTClearBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE1_ENABLE | PIN_BRIDGE2_ENABLE);
		PORTSetPinsDigitalOut(PORT_BRIDGE_ENABLE, PIN_BRIDGE1_ENABLE | PIN_BRIDGE2_ENABLE);
	}

	extern inline void __attribute__((always_inline)) EnableMotorDrive(void)
	{
		

		PORTSetBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE1_ENABLE | PIN_BRIDGE2_ENABLE);
	}

	extern inline void __attribute__((always_inline)) DisableMotorDrive(void)
	{
		PORTClearBits(PORT_BRIDGE_ENABLE, PIN_BRIDGE1_ENABLE | PIN_BRIDGE2_ENABLE);

	
	}

	extern inline UINT16 __attribute__((always_inline)) ReadBridgeSFPins(void)
	{
		//???
	}

#endif		// NOT PLATFORM_PIC32_SK


/*********************************************************************
* PIC32 Motion Sensor Definitions
*********************************************************************/

#if defined (PLATFORM_PIC32_SK)
	// Pin to Input Capture Module Assignments:
	// RD8		IC1
	// RD9		IC2
	// RD10		IC3
	// RD11		IC4

	//	Azimuth Motion Sensor	IC1		RD8		Digital In	IC1
	//	Elevation Motion Sensor	IC2		RD9		Digital In	IC2

	#define PORT_INPUT_CAPTURE		IOPORT_D
	#define PORT_MOTION_SENSOR		PORT_INPUT_CAPTURE

	#define	PIN_AZIMUTH_SENSOR		BIT_8
	#define	PIN_ELEVATION_SENSOR	BIT_9

	// these functions allow direct reading of the pins; they are NOT necessary for Input Capture
	extern inline void __attribute__((always_inline)) InitMotionSensorPins(void)
	{
		PORTClearBits(PORT_MOTION_SENSOR, PIN_AZIMUTH_SENSOR | PIN_ELEVATION_SENSOR );

		PORTSetPinsDigitalIn(PORT_MOTION_SENSOR, PIN_AZIMUTH_SENSOR | PIN_ELEVATION_SENSOR );
	}

	extern inline UINT16 __attribute__((always_inline)) ReadMotionSensorPins(void)
	{
		return (PORTReadBits(PORT_MOTION_SENSOR, PIN_AZIMUTH_SENSOR | PIN_ELEVATION_SENSOR ));
	}

	// definitions for Input Capture
	#define	AZ_ICCONbits		IC1CONbits
	#define	AZ_ICBUF			IC1BUF
	#define	AZ_ICClearIntFlag	mIC1ClearIntFlag
	#define	AZ_OpenCapture		OpenCapture1
	#define	AZ_ConfigIntCapture	ConfigIntCapture1

	#define	EL_ICCONbits		IC2CONbits
	#define	EL_ICBUF			IC2BUF
	#define	EL_ICClearIntFlag	mIC2ClearIntFlag
	#define	EL_OpenCapture		OpenCapture2
	#define	EL_ConfigIntCapture	ConfigIntCapture2

#elif defined (PLATFORM_SMARTTRAK_V1)
	// Pin to Input Capture Module Assignments:
	// RD8		IC1
	// RD9		IC2
	// RD10		IC3
	// RD11		IC4

	//	AZ0		Azimuth Hall Effect A		RD10		Digital In	IC3
	//	AZ1		Azimuth Hall Effect B		RD11		Unused
	//	EL0		Elevation Hall Effect A		RD8			Digital In	IC1
	//	EL1		Elevation Hall Effect B		RD9			Unused

	#define PORT_INPUT_CAPTURE		IOPORT_D
	#define PORT_MOTION_SENSOR		PORT_INPUT_CAPTURE

	#define	PIN_AZIMUTH_SENSOR		BIT_10
	#define	PIN_ELEVATION_SENSOR	BIT_8

	// these functions allow direct reading of the pins; they are NOT necessary for Input Capture
	extern inline void __attribute__((always_inline)) InitMotionSensorPins(void)
	{
		PORTClearBits(PORT_MOTION_SENSOR, PIN_AZIMUTH_SENSOR | PIN_ELEVATION_SENSOR );

		PORTSetPinsDigitalIn(PORT_MOTION_SENSOR, PIN_AZIMUTH_SENSOR | PIN_ELEVATION_SENSOR );
	}

	extern inline UINT16 __attribute__((always_inline)) ReadMotionSensorPins(void)
	{
		return (PORTReadBits(PORT_MOTION_SENSOR, PIN_AZIMUTH_SENSOR | PIN_ELEVATION_SENSOR ));
	}

	// definitions for Input Capture
	#define	AZ_ICCONbits		IC3CONbits
	#define	AZ_ICBUF			IC3BUF
	#define	AZ_ICClearIntFlag	mIC3ClearIntFlag
	#define	AZ_OpenCapture		OpenCapture3
	#define	AZ_ConfigIntCapture	ConfigIntCapture3

	#define	EL_ICCONbits		IC1CONbits
	#define	EL_ICBUF			IC1BUF
	#define	EL_ICClearIntFlag	mIC1ClearIntFlag
	#define	EL_OpenCapture		OpenCapture1
	#define	EL_ConfigIntCapture	ConfigIntCapture1

#endif		// PLATFORM_SMARTTRAK_V1

/*********************************************************************
* PIC32 Motion Sensor Feedback Simulator Definitions
*********************************************************************/
#ifdef	USE_FEEDBACK_SIMULATOR

	#if defined (PLATFORM_PIC32_SK)

		//	Azimuth Motion Feedback Simulator	RF0		Digital Out
		//	Elevation Motion Feedback Simulator	RF1		Digital Out

		#define PORT_FEEDBACK_SIMULATOR	IOPORT_F

		#define	PIN_AZIMUTH_FEEDBACK_SIMULATOR		BIT_0
		#define	PIN_ELEVATION_FEEDBACK_SIMULATOR	BIT_1

