konaiahgari-nithish-reddy/base_text/edge-firmware-BaseCode/Stm32U5TrackerEnable/Core/Inc/Tracker/HardwareProfile_STM32.h
	extern inline void __attribute__((always_inline)) InitMotionFeedbackSimulatorPins(void)
	{
		PORTClearBits(PORT_FEEDBACK_SIMULATOR, PIN_AZIMUTH_FEEDBACK_SIMULATOR | PIN_ELEVATION_FEEDBACK_SIMULATOR );

		PORTSetPinsDigitalOut(PORT_FEEDBACK_SIMULATOR, PIN_AZIMUTH_FEEDBACK_SIMULATOR | PIN_ELEVATION_FEEDBACK_SIMULATOR );
	}

	extern inline void __attribute__((always_inline)) SetFeedbackSimulator(UINT16 nAxis)
	{
		if (nAxis == 0)
			PORTSetBits(PORT_FEEDBACK_SIMULATOR, PIN_AZIMUTH_FEEDBACK_SIMULATOR);
		else if (nAxis == 1)
			PORTSetBits(PORT_FEEDBACK_SIMULATOR, PIN_ELEVATION_FEEDBACK_SIMULATOR);
	}

	extern inline void __attribute__((always_inline)) ClearFeedbackSimulator(UINT16 nAxis)
	{
		if (nAxis == 0)
			PORTClearBits(PORT_FEEDBACK_SIMULATOR, PIN_AZIMUTH_FEEDBACK_SIMULATOR);
		else if (nAxis == 1)
			PORTClearBits(PORT_FEEDBACK_SIMULATOR, PIN_ELEVATION_FEEDBACK_SIMULATOR);
	}

	#elif defined (PLATFORM_SMARTTRAK_V1)
		#error  "SmartTrak hardware version not yet defined"
	#endif		// NOT PLATFORM_PIC32_SK

#endif		// USE_FEEDBACK_SIMULATOR


/*********************************************************************
* PIC32 Oscilloscope Trigger Definitions
*********************************************************************/

// assigned pins are the same for both platforms

#define PORT_SCOPE_TRIGGER					IOPORT_B

#define	PIN_SCOPE_TRIGGER1					BIT_10				// PIC32 Starter Kit I/O Expansion J10-47, SmartTrak J10-9
#define	PIN_SCOPE_TRIGGER2					BIT_11


extern inline void __attribute__((always_inline)) InitTriggerPins(void)
{
	PORTClearBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1 | PIN_SCOPE_TRIGGER2 );

	PORTSetPinsDigitalOut(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1 | PIN_SCOPE_TRIGGER2 );
}

extern inline void __attribute__((always_inline)) Trigger1Level(UINT8 cLevel)
{
	if (cLevel == 0)
	{
		PORTClearBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1);
	}
	else if (cLevel == 1)
	{
		PORTClearBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1);
		PORTSetBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1);
	}
}

extern inline void __attribute__((always_inline)) Trigger1Pulse(void)
{
	PORTClearBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1);
	PORTSetBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1);
	PORTClearBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1);
}


extern inline void __attribute__((always_inline)) Trigger1Toggle(void)
{
	if (PORTReadBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1) == 0)
		PORTSetBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1);
	else
		PORTClearBits(PORT_SCOPE_TRIGGER, PIN_SCOPE_TRIGGER1);
}



//#define	TOGGLE_DEBUG_PIN1	DEBUG_PIN1 = ((DEBUG_PIN1 == 1) ? 0 : 1)
//#define	DEBUG_PIN2_HI		DEBUG_PIN2 = 0; DEBUG_PIN2 = 1
//#define	DEBUG_PIN2_LOW		DEBUG_PIN2 = 0;
//#define	DEBUG_PIN3_HI		DEBUG_PIN3 = 0; DEBUG_PIN3 = 1
//#define	DEBUG_PIN3_LOW		DEBUG_PIN3 = 0;


/*********************************************************************
* J9 Spare Pins
*********************************************************************/

// Note: J9-1 and J9-2 are assigned above as scope trigger pins, but could be reassigned here
// assigned pins are the same for both platforms (?)

#define PORT_J9								IOPORT_B

#define	PIN_J9_3							BIT_12
#define	PIN_J9_4							BIT_13
#define	PIN_J9_5							BIT_14
#define	PIN_J9_6							BIT_15

// pin usage assignments
#define	PIN_XBEE_RESET						PIN_J9_3
#define	PIN_XBEE_DETECT						PIN_J9_4		// input

#define	PIN_MOTOR_FWD_RELAY					PIN_J9_5
#define	PIN_MOTOR_REV_RELAY					PIN_J9_6



extern inline void __attribute__((always_inline)) InitJ9Pins(void)
{
	PORTSetBits(PORT_J9, PIN_J9_3 | PIN_J9_4 | PIN_J9_5 | PIN_J9_6 );			// relay drive for 2 x 5V Relay board is active LOW, XBee Reset is active LOW

	PORTSetPinsDigitalOut(PORT_J9, PIN_J9_3 | PIN_J9_5 | PIN_J9_6 );

	PORTSetPinsDigitalIn(PORT_J9, PIN_J9_4);

}

extern inline void __attribute__((always_inline)) SetJ9Pin(UINT16 J9_Pin)
{
	PORTSetBits(PORT_J9, J9_Pin);
}

extern inline void __attribute__((always_inline)) ClearJ9Pin(UINT16 J9_Pin)
{
	PORTClearBits(PORT_J9, J9_Pin);
}


extern inline UINT16 __attribute__((always_inline)) ReadJ9Pin(UINT16 J9_Pin)
{
	return (PORTReadBits(PORT_J9, J9_Pin));
}


#endif // __HARDWARE_PROFILE_H
